printList examples:

?- printList([[2,3,1,4,5,6],[2,3,2,4,5,6],[3,3,3,4,4,4],[5,5,5,6,6,6]]).
[2,3,1,4,5,6]
[2,3,2,4,5,6]
[3,3,3,4,4,4]
[5,5,5,6,6,6]
true.

?- printList([[3,3,3],[4,4,4],[5,5,5],[6,6,6],[7,7,7]]).
[3,3,3]
[4,4,4]
[5,5,5]
[6,6,6]
[7,7,7]
true.

theClass examples:

?- theClass([2,2,2,3],Class).
Class = 3 .

?- theClass([2,2,2,7,3,2,9,8,5],Class).
Class = 5 .

distanceR2 examples:

?- distanceR2([2,3,4,5],[6,7,8,9],DistSq).
DistSq = 48 .

?- distanceR2([2.2,3.4,4.2,5.6,4.5],[6.8,7.3,8.4,9.4,6.6],DistSq).
DistSq = 68.45 .

distanceAllVectors2 examples:

?- distanceAllVectors2([2,1,0],[[5, 5, 1], [5, -5, 2], [-5, -5, 3], [-5, 5, 4]],Dlist).
Dlist = [25, 45, 85, 65] .

?- distanceAllVectors2([2,-1,0],[[5, 5, 1], [5, -5, 2], [-5, -5, 3], [-5, 5, 4]],Dlist).
Dlist = [45, 25, 65, 85] .

nnr1 examples:

?- nnr1([-1,-2,0],[[5, 5, 1], [5, -5, 2], [-5, -5, 3], [-5, 5, 4]],Class).
Class = 3 .

?- nnr1([6,-2,0],[[5, 5, 1], [5, -5, 2], [-5, -5, 3], [-5, 5, 4]],Class).
Class = 2 .